app/Controllers/Products.php

    public function index()
    {

        $data = [
            'title' => 'Products',
            'page' => 'Products',

        ];
        //get products]
        $product_model = new ProductModel();
        $data['products'] = $product_model->findAll();
---
SELECT *
FROM `products`

    public function new_product()
    {

        $data = [
            'title' => 'Products',
            'page' => 'Cadastro de produto',

        ];
        $data['validation_errors'] = session()->getFlashdata('validation_errors');

        //carrega categoria
        $product_model = new ProductModel();
        $data['categories'] = $product_model->select('category')->distinct()->findAll();
        $data['marcas'] = $product_model->select('marca')->distinct()->findAll();
        $data['cores'] = $product_model->select('color')->distinct()->findAll();
---
SELECT DISTINCT `category`
FROM `products`
SELECT DISTINCT `marca`
FROM `products`
SELECT DISTINCT `color`
FROM `products`

    public function edit($id)
    {
        $data = [
            'title' => 'Products',
            'page' => 'Edição  de produto',
                ];
        $data['validation_errors'] = session()->getFlashdata('validation_errors');
        $product_model = new ProductModel();
        $data['product'] = $product_model->find($id);

        //carrega categoria
        $data['categories'] = $product_model->select('category')->distinct()->findAll();
        $data['marcas'] = $product_model->select('marca')->distinct()->findAll();
        $data['cores'] = $product_model->select('color')->distinct()->findAll();
---
SELECT *
FROM `products`
WHERE `products`.`id` = '1'
SELECT DISTINCT `category`
FROM `products`
SELECT DISTINCT `marca`
FROM `products`
SELECT DISTINCT `color`
FROM `products`

        $products_model = new ProductModel();

        //checar se existe produto
        $product = $products_model->where('name', $this->request->getPost('name'))->where('id != ', $this->request->getPost('id_product'))->first();
---
SELECT *
FROM `products`
WHERE `name` = 'Smartphone Galaxy S21ww4'
AND `id` != '1'
 LIMIT 1

            'final_promotion_date' => $data_final
        ];
        //update
        $products_model->update($id ,$data);
---
UPDATE `products` SET `inicial_promotion_date` = '2024-05-12', `final_promotion_date` = '2024-05-12', `updated_at` = '2024-05-13 01:40:57'
WHERE `products`.`id` IN ('1')